# GetCutLayerModifiers Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLayerInfo..::..GetCutLayerModifiers Method
ExportLayerInfo Class See Also
---
Gets all the cut layer modifiers from the layer info.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<LayerModifier> GetCutLayerModifiers()
```

Visual Basic
---
```text
Public Function GetCutLayerModifiers As IList(Of LayerModifier)
```

Visual C++
---
```text
public:
IList<LayerModifier^>^ GetCutLayerModifiers()
```

# ### Return Value
The cut layer modifier array.
# See Also
ExportLayerInfo Class
Autodesk.Revit.DB Namespace